# Pandas and Excel

In [1]:
import pandas as pd
import numpy as np

## First try: Open an Excel file with default parameters.

In [2]:
df = pd.read_excel("simple_file.xlsx")

In [3]:
df

,Some Data,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Some Explanation
0,Main Column,January,February,March,April,May,June,July,August,September,October,November,December,NaN,"Lorem ipsum dolor sit amet, consetetur sadipsc..."
1,Value 1,123,321,312,213,312,222,111,124,0,0,0,0,NaN,NaN
2,Value 2,67,34,56,76,123,545,444,442,0,0,0,0,NaN,1. Explanation 1
3,Value 3,78,23,77,77,222,434,544,234,0,0,0,0,NaN,NaN
4,Value 4,89,12,56,55,33,333,654,423,0,0,0,0,NaN,NaN
5,Value 5,0.491632,0.478972,0.579097,0.638244,0.511928,0.675326,0.606272,0.762846,0,0,0,0,NaN,NaN
6,Value 6,0.8899,0.920011,0.732506,0.671966,0.616595,0.667848,0.868355,0.276603,0,0,0,0,NaN,NaN
7,Value 7,0.437504,0.44066,0.424193,0.428878,0.315652,0.451015,0.526459,0.211006,0,0,0,0,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,Some sub headline!,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Auxiliary calculations
11,Employees,Something 1,Something 2,Something 3,Something 4,Something 5,Something 6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,123 Things
12,John Doe,14.3,10,0.34,0.65,0.5,-0.15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,111 Things not used
13,Jane Doe,16,8,1.41,0.67,0.6,-0.07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20 Whatever
14,Lorem Ipsum,8,4,2.01,0.56,0.7,0.14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,Paul Weller,6,5,2.1,0.12,0.8,0.68,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,Dave Grohl,12,10.66,2.22,0.75,0.9,0.15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,Mr. Big,11,11.38,3.3,0.64,0.2,-0.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,The Dude,21,12.325,2.1,0.34,0.3,-0.04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,Bart Simpson,24,17.88,5.5,0.12,0.4,0.28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,Iron Man,12,1.44,7.1,0.55,0.5,-0.05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,Thomas H.,20,2,2,0.11,0.6,0.49,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,144.3,82.685,28.08,0.451,0.55,0.099,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Well, thats not pretty and declutter this data frame isn't fun. Let's use some parameters to specify what cells we want to get into our data frame.

In [4]:
df = pd.read_excel("simple_file.xlsx", header=1, usecols="A:M", nrows=7)

In [5]:
df

,Main Column,January,February,March,April,May,June,July,August,September,October,November,December
0,Value 1,123.000000,321.000000,312.000000,213.000000,312.000000,222.000000,111.000000,124.000000,0,0,0,0
1,Value 2,67.000000,34.000000,56.000000,76.000000,123.000000,545.000000,444.000000,442.000000,0,0,0,0
2,Value 3,78.000000,23.000000,77.000000,77.000000,222.000000,434.000000,544.000000,234.000000,0,0,0,0
3,Value 4,89.000000,12.000000,56.000000,55.000000,33.000000,333.000000,654.000000,423.000000,0,0,0,0
4,Value 5,0.491632,0.478972,0.579097,0.638244,0.511928,0.675326,0.606272,0.762846,0,0,0,0
5,Value 6,0.889900,0.920011,0.732506,0.671966,0.616595,0.667848,0.868355,0.276603,0,0,0,0
6,Value 7,0.437504,0.440660,0.424193,0.428878,0.315652,0.451015,0.526459,0.211006,0,0,0,0

That's looking much better. We are able to read the cells between columns A to M using row 2 (excel starts counting at 1, pandas at 0) as our header and read seven rows with data starting from our row which is declared as header.

Now let's read the second table with data from our sheet.

In [6]:
df_employees = pd.read_excel("simple_file.xlsx", header=12, usecols="A:G", nrows=10)

In [7]:
df_employees

,Employees,Something 1,Something 2,Something 3,Something 4,Something 5,Something 6
0,John Doe,14.3,10.000,0.34,0.65,0.5,-0.15
1,Jane Doe,16.0,8.000,1.41,0.67,0.6,-0.07
2,Lorem Ipsum,8.0,4.000,2.01,0.56,0.7,0.14
3,Paul Weller,6.0,5.000,2.10,0.12,0.8,0.68
4,Dave Grohl,12.0,10.660,2.22,0.75,0.9,0.15
5,Mr. Big,11.0,11.380,3.30,0.64,0.2,-0.44
6,The Dude,21.0,12.325,2.10,0.34,0.3,-0.04
7,Bart Simpson,24.0,17.880,5.50,0.12,0.4,0.28
8,Iron Man,12.0,1.440,7.10,0.55,0.5,-0.05
9,Thomas H.,20.0,2.000,2.00,0.11,0.6,0.49

That was easy! Lets try somethng more complex

### More complex example
Let's open an file with 4 sheets. the first sheet is a cover page we don't want to use. the following 3 sheets are in the same layout with data we want to read and use in a data frame.

In [8]:
df_complex = pd.read_excel("complex_file.xlsx", sheet_name=['Sheet 1', 2, 3], header=9, usecols="A,B,D:H", nrows=19, dtype={'#': np.object})

With `sheet_name` we are able to select which sheet(s) we want to use. Either pass a number or string with sheet name or pass a list of Sheets defined as names or number. Again: Excel starts counting at 1, Pandas at 0. First sheet is number 0. 

We perform for every sheet the same actions to interpret the data. Pandas returns a dictionary of dataframes.

In [9]:
# optional: get rid of rows with NA to get clear data for each sheet
df_sheet1 = df_complex['Sheet 1'].dropna()
df_sheet2 = df_complex[2].dropna()
df_sheet3 = df_complex[3].dropna()

In [10]:
df_sheet1

     #    Person  Column 4  Column 5  Column 6   Column 7  Column 8
0  123  Person 1     15.00     650.0    432.12  6481.8000   9750.00
1  124  Person 2     14.50     650.0    432.12  6265.7400   9425.00
2  125  Person 3      0.25     555.0    432.12   108.0300    138.75
3  126  Person 4      2.12     555.0    432.12   916.0944   1176.60
4  127  Person 5      5.64     650.0    432.12  2437.1568   3666.00
5  128  Person 6     12.10     400.0    432.12  5228.6520   4840.00
6  129  Person 7      3.56     300.0    432.12  1538.3472   1068.00

In [11]:
df_sheet2

     #     Person  Column 4  Column 5  Column 6   Column 7  Column 8
0  123   Person 1     15.00     650.0    432.12  6481.8000   9750.00
1  124   Person 2     14.50     650.0    432.12  6265.7400   9425.00
2  125   Person 3      0.25     555.0    432.12   108.0300    138.75
3  126   Person 4      2.12     555.0    432.12   916.0944   1176.60
4  127   Person 5      5.64     650.0    432.12  2437.1568   3666.00
5  128   Person 6     12.10     400.0    432.12  5228.6520   4840.00
6  129   Person 7      3.56     300.0    432.12  1538.3472   1068.00
7  130   Person 8      6.70     550.0    432.12  2895.2040   3685.00
8  131   Person 9      8.99     651.0    432.12  3884.7588   5852.49
9  132  Person 10     10.25     700.0    432.12  4429.2300   7175.00

In [12]:

df_sheet3

      #     Person  Column 4  Column 5  Column 6    Column 7  Column 8
0   123   Person 1    15.000     650.0    432.12   6481.8000   9750.00
1   124   Person 2    14.500     650.0    432.12   6265.7400   9425.00
2   125   Person 3     0.250     555.0    432.12    108.0300    138.75
3   126   Person 4     2.120     555.0    432.12    916.0944   1176.60
4   127   Person 5     5.640     650.0    432.12   2437.1568   3666.00
5   128   Person 6    12.100     400.0    432.12   5228.6520   4840.00
6   129   Person 7     3.560     300.0    432.12   1538.3472   1068.00
7   130   Person 8    11.450     450.0    432.12   4947.7740   5152.50
8   131   Person 9    22.320     550.0    432.12   9644.9184  12276.00
9   132  Person 10    20.180     425.0    432.12   8720.1816   8576.50
10  133  Person 11    32.000     375.0    432.12  13827.8400  12000.00
11  134  Person 12     5.570     650.0    432.12   2406.9084   3620.50
12  135  Person 13     8.875     750.0    444.00   3940.5000   6656.25
13  136  Person 14     3.250     555.0    432.12   1404.3900   1803.75
14  137  Person 15    12.230     475.0    432.12   5284.8276   5809.25
15  138  Person 16     0.330     650.0    575.00    189.7500    214.50
16  139  Person 17     2.750     123.0    432.12   1188.3300    338.25

Nice! Isn't it?